<template>
  <section class="main-content page-container">
    <div class="main-content__item video padding-left-right padding-left-right-top padding-top-107">
      <!-- <video class="main-content__img-bg" autoplay muted loop>
            <source src="/wp-content/themes/Jeepping/assets/img/bg-1.mp4" type="video/mp4">
        </video> -->
      <div class="main-content__container margin-top-167">
        <div class="main-content__block-elements border-white">
          <div class="main-content__head-content">
            <ul class="head-content__chips">
              <li class="chips__item">Крафтово</li>
              <li class="chips__item">Беззаботно</li>
              <li class="chips__item">Доступно</li>
            </ul>
            <span class="head-content__year">2023</span>
          </div>
          <h2 class="main-content__title">Авторские джип туры
            по Северной–Осетии</h2>
          <div class="block-elements__mobile">
            <div class="block-elements__for-love">С любовью</div>
            <span class="head-content__year">2023</span>
          </div>
          <div class="block-elements__down">
            <button type="button" class="button button--header button--red button--small-red open-btn">
              <div class="button__item-and-icon padding-unset">
                <span>Подобрать тур</span>
                <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                  <path d="M4.16699 15.8333L15.0003 5M15.0003 5V15.4M15.0003 5H4.60033" stroke="white" stroke-width="2"
                    stroke-linecap="round" stroke-linejoin="round" />
                </svg>
              </div>
            </button>
            <div class="block-elements__for-love">С любовью</div>
          </div>
        </div>
      </div>
    </div>
    <div class="main-content__item item--flex-center padding-top-107 margin-top-vmeste">
      <picture class="main-content__img-bg main-content__special-class-for-img-contain">
        <source srcset="../assets/img/Вместе-mobile.png" media="(max-width: 577px)" />
        <source srcset="../assets/img/Вместе-mobile-320.png" media="(max-width: 374px)" />
        <img src="../assets/img/Вместе.png" alt="" loading="eager" />
      </picture>
      <div class="main-content__container">
        <div class="main-content__block-elements">
          <div class="block-elements__two-blocks">
            <div class="two-block__container">
              <div class="two-blocks__block">
                <ul class="head-content__chips">
                  <li class="chips__item">
                    <div class="chips__container">
                      <svg width="18" height="19" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                          d="M6.94859 15.2785C6.81323 15.4413 6.55082 15.3097 6.60035 15.1039L7.60051 10.9471C7.62635 10.8397 7.56024 10.7317 7.45285 10.7059L5.12443 10.1456C4.97951 10.1108 4.92229 9.9353 5.01879 9.8217L10.2858 3.62091C10.4221 3.46043 10.682 3.59245 10.6327 3.79718L9.62785 7.97341C9.60201 8.0808 9.66812 8.18881 9.77552 8.21464L12.0016 8.75026C12.1456 8.78491 12.2033 8.95867 12.1086 9.07258L6.94859 15.2785Z"
                          fill="white" />
                      </svg>
                      <p style="text-transform: uppercase;">НАША СИЛА</p>
                    </div>
                  </li>
                </ul>

                <p class="two-blocks__text">Наша несомненная сила - это умение сращивать классные места в
                  единый
                  маршрут, тем самым
                  экономя ваше время и деньги. Мы показали и погрузили в эти красоты сотни
                  путешественников,
                  но все еще не вас.</p>
              </div>
            </div>
            <div class="two-block__container">
              <div class="two-blocks__block">
                <ul class="head-content__chips">
                  <li class="chips__item">
                    <div class="chips__container">
                      <svg width="18" height="19" viewBox="0 0 18 19" fill="none" xmlns="http://www.w3.org/2000/svg">
                        <path
                          d="M15 7.66955C15.0021 8.56717 14.6464 9.43066 14.0076 10.0788C12.543 11.5552 11.1221 13.0946 9.60353 14.5168C9.25492 14.8377 8.70232 14.826 8.36931 14.4906L3.99226 10.0793C2.66925 8.74582 2.66925 6.59329 3.99226 5.26035C4.30495 4.94126 4.68103 4.68723 5.09771 4.51366C5.51438 4.34008 5.96298 4.25058 6.41629 4.25058C6.8696 4.25058 7.3182 4.34008 7.73487 4.51366C8.15155 4.68723 8.52763 4.94126 8.84032 5.26035L8.99992 5.42018L9.15892 5.26035C9.47224 4.94202 9.84843 4.68845 10.265 4.51484C10.6815 4.34123 11.1298 4.25115 11.583 4.25C12.495 4.25 13.3668 4.61401 14.007 5.26035C14.646 5.90835 15.0019 6.77185 15 7.66955Z"
                          fill="white" />
                      </svg>
                      <p style="text-transform: uppercase;">НАША ЗАДАЧА</p>
                    </div>
                  </li>
                </ul>
                <p class="two-blocks__text">Ощутить дух региона, познакомить с его классным бытом и кухней -
                  задача наших туров.</p>
              </div>
              <button type="button" class="button button--red button--big-red open-btn">
                <div class="button__item-and-icon">
                  <span>Посмотреть туры</span>
                  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
                    <path d="M4.16699 15.8333L15.0003 5M15.0003 5V15.4M15.0003 5H4.60033" stroke="white" stroke-width="2"
                      stroke-linecap="round" stroke-linejoin="round"></path>
                  </svg>
                </div>
              </button>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="main-content__item bg-white padding-60-20">
      <div class="tours-list margin-top-194">
        <h2 class="tours-list__title">Познай Осетию</h2>
        <div class="tabs-container--for-scroll">
          <div class="tabs-container tabs-container--tours-list">
            <span class="tab" v-for="tab in tabs" :key="tab.id" :class="{ 'tab-active': activeTab === tab.id }"
              @click="toggleTab(tab.id)">
              {{ tab.title }}
            </span>
          </div>
        </div>
        <div class="tours-list__block-elements" ref="blockElements">
          <div id="day-tours" class="tab-container show-tab">
            <div class="block-elements__item" data-place>
              <div class="tours-list__bg-color"></div>
              <img class="tours-list__bg" src="" alt="">
              <a href="" class="tours-list__link-title" data-link>
                231
              </a>
              <span class="tours-list__day-and-date">
                • Ближайшая дата
                123
              </span>
              <div class="tour-list__price-container">
                <div class="tours-list__prices">
                  <div class="tours-list__price-with-interest">
                    <div class="tours-list__with-interest">
                      <div class="tours-list__special-class-flex">
                        <svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path
                            d="M12.6667 3.83337L3.33337 13.1667M11.3334 13.1667C10.9798 13.1667 10.6406 13.0262 10.3906 12.7762C10.1405 12.5261 10 12.187 10 11.8334C10 11.4798 10.1405 11.1406 10.3906 10.8906C10.6406 10.6405 10.9798 10.5 11.3334 10.5C11.687 10.5 12.0261 10.6405 12.2762 10.8906C12.5262 11.1406 12.6667 11.4798 12.6667 11.8334C12.6667 12.187 12.5262 12.5261 12.2762 12.7762C12.0261 13.0262 11.687 13.1667 11.3334 13.1667ZM4.66671 6.50004C4.31309 6.50004 3.97395 6.35956 3.7239 6.10952C3.47385 5.85947 3.33337 5.52033 3.33337 5.16671C3.33337 4.81309 3.47385 4.47395 3.7239 4.2239C3.97395 3.97385 4.31309 3.83337 4.66671 3.83337C5.02033 3.83337 5.35947 3.97385 5.60952 4.2239C5.85956 4.47395 6.00004 4.81309 6.00004 5.16671C6.00004 5.52033 5.85956 5.85947 5.60952 6.10952C5.35947 6.35956 5.02033 6.50004 4.66671 6.50004Z"
                            stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>

                        ₽
                      </div>
                    </div>
                    <div class="tours-list__without-interest">
                      ₽
                    </div>
                  </div>
                  <span class="tours-list__price-for-human">цена за 1 чел.</span>
                </div>
              </div>
            </div>
            <div class="block-elements__item" data-place>
              <div class="tours-list__bg-color"></div>
              <img class="tours-list__bg" src="" alt="">
              <a href="" class="tours-list__link-title" data-link>
                231
              </a>
              <span class="tours-list__day-and-date">
                • Ближайшая дата
                123
              </span>
              <div class="tour-list__price-container">
                <div class="tours-list__prices">
                  <div class="tours-list__price-with-interest">
                    <div class="tours-list__with-interest">
                      <div class="tours-list__special-class-flex">
                        <svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path
                            d="M12.6667 3.83337L3.33337 13.1667M11.3334 13.1667C10.9798 13.1667 10.6406 13.0262 10.3906 12.7762C10.1405 12.5261 10 12.187 10 11.8334C10 11.4798 10.1405 11.1406 10.3906 10.8906C10.6406 10.6405 10.9798 10.5 11.3334 10.5C11.687 10.5 12.0261 10.6405 12.2762 10.8906C12.5262 11.1406 12.6667 11.4798 12.6667 11.8334C12.6667 12.187 12.5262 12.5261 12.2762 12.7762C12.0261 13.0262 11.687 13.1667 11.3334 13.1667ZM4.66671 6.50004C4.31309 6.50004 3.97395 6.35956 3.7239 6.10952C3.47385 5.85947 3.33337 5.52033 3.33337 5.16671C3.33337 4.81309 3.47385 4.47395 3.7239 4.2239C3.97395 3.97385 4.31309 3.83337 4.66671 3.83337C5.02033 3.83337 5.35947 3.97385 5.60952 4.2239C5.85956 4.47395 6.00004 4.81309 6.00004 5.16671C6.00004 5.52033 5.85956 5.85947 5.60952 6.10952C5.35947 6.35956 5.02033 6.50004 4.66671 6.50004Z"
                            stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>

                        ₽
                      </div>
                    </div>
                    <div class="tours-list__without-interest">
                      ₽
                    </div>
                  </div>
                  <span class="tours-list__price-for-human">цена за 1 чел.</span>
                </div>
              </div>
            </div>
          </div>
          <div id="weekend-tour" class="tab-container">
            <div class="block-elements__item" data-place>
              <div class="tours-list__bg-color"></div>
              <img class="tours-list__bg" src="" alt="">
              <a href="" class="tours-list__link-title" data-link>
                123
              </a>
              <span class="tours-list__day-and-date">
                • Ближайшая дата
                123
              </span>
              <div class="tour-list__price-container">
                <div class="tours-list__prices">
                  <div class="tours-list__price-with-interest">
                    <div class="tours-list__with-interest">
                      <div class="tours-list__special-class-flex">
                        <svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path
                            d="M12.6667 3.83337L3.33337 13.1667M11.3334 13.1667C10.9798 13.1667 10.6406 13.0262 10.3906 12.7762C10.1405 12.5261 10 12.187 10 11.8334C10 11.4798 10.1405 11.1406 10.3906 10.8906C10.6406 10.6405 10.9798 10.5 11.3334 10.5C11.687 10.5 12.0261 10.6405 12.2762 10.8906C12.5262 11.1406 12.6667 11.4798 12.6667 11.8334C12.6667 12.187 12.5262 12.5261 12.2762 12.7762C12.0261 13.0262 11.687 13.1667 11.3334 13.1667ZM4.66671 6.50004C4.31309 6.50004 3.97395 6.35956 3.7239 6.10952C3.47385 5.85947 3.33337 5.52033 3.33337 5.16671C3.33337 4.81309 3.47385 4.47395 3.7239 4.2239C3.97395 3.97385 4.31309 3.83337 4.66671 3.83337C5.02033 3.83337 5.35947 3.97385 5.60952 4.2239C5.85956 4.47395 6.00004 4.81309 6.00004 5.16671C6.00004 5.52033 5.85956 5.85947 5.60952 6.10952C5.35947 6.35956 5.02033 6.50004 4.66671 6.50004Z"
                            stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>

                        ₽
                      </div>
                    </div>
                    <div class="tours-list__without-interest">
                      ₽
                    </div>
                  </div>
                  <span class="tours-list__price-for-human">цена за 1 чел.</span>
                </div>
              </div>
            </div>
          </div>
          <div id="multi-day-tours" class="tab-container">
            <div class="block-elements__item" data-place>
              <div class="tours-list__bg-color"></div>
              <img class="tours-list__bg" src="" alt="">
              <a href="" class="tours-list__link-title" data-link>
                144
              </a>
              <span class="tours-list__day-and-date">
                123
                123 • Ближайшая дата
                123
              </span>
              <div class="tour-list__price-container">
                <div class="tours-list__prices">
                  <div class="tours-list__price-with-interest">
                    <div class="tours-list__with-interest">
                      <div class="tours-list__special-class-flex">
                        <svg width="16" height="17" viewBox="0 0 16 17" fill="none" xmlns="http://www.w3.org/2000/svg">
                          <path
                            d="M12.6667 3.83337L3.33337 13.1667M11.3334 13.1667C10.9798 13.1667 10.6406 13.0262 10.3906 12.7762C10.1405 12.5261 10 12.187 10 11.8334C10 11.4798 10.1405 11.1406 10.3906 10.8906C10.6406 10.6405 10.9798 10.5 11.3334 10.5C11.687 10.5 12.0261 10.6405 12.2762 10.8906C12.5262 11.1406 12.6667 11.4798 12.6667 11.8334C12.6667 12.187 12.5262 12.5261 12.2762 12.7762C12.0261 13.0262 11.687 13.1667 11.3334 13.1667ZM4.66671 6.50004C4.31309 6.50004 3.97395 6.35956 3.7239 6.10952C3.47385 5.85947 3.33337 5.52033 3.33337 5.16671C3.33337 4.81309 3.47385 4.47395 3.7239 4.2239C3.97395 3.97385 4.31309 3.83337 4.66671 3.83337C5.02033 3.83337 5.35947 3.97385 5.60952 4.2239C5.85956 4.47395 6.00004 4.81309 6.00004 5.16671C6.00004 5.52033 5.85956 5.85947 5.60952 6.10952C5.35947 6.35956 5.02033 6.50004 4.66671 6.50004Z"
                            stroke="white" stroke-width="1.5" stroke-linecap="round" stroke-linejoin="round" />
                        </svg>

                        ₽
                      </div>
                    </div>
                    <div class="tours-list__without-interest">
                      ₽
                    </div>
                  </div>
                  <span class="tours-list__price-for-human">цена за 1 чел.</span>
                </div>
              </div>
            </div>
          </div>
        </div>
      </div>
    </div>
    <div class="main-content__item bg-white padding-60-20">
      <div class="personal-offer margin-top-194">
        <div class="personal-offer__title-container">
          <div class="personal-offer__title-container">
            <h2 class="personal-offer__title">
              Хотите персональное<br>предложение?
            </h2>
            <svg class="before-4-step" width="106" height="54" viewBox="0 0 106 54" fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M5.95533 4.85604C6.61319 2.17412 9.32061 0.533298 12.0025 1.19115L96.5193 21.9225L103.273 32.0738L99.2828 48.3415C98.6249 51.0234 95.9175 52.6643 93.2356 52.0064L8.71886 31.275L1.96497 21.1238L5.95533 4.85604Z"
                fill="#D9D9D9" />
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M5.95533 4.85604C6.61319 2.17412 9.32061 0.533298 12.0025 1.19115L96.5193 21.9225L103.273 32.0738L99.2828 48.3415C98.6249 51.0234 95.9175 52.6643 93.2356 52.0064L8.71886 31.275L1.96497 21.1238L5.95533 4.85604Z"
                fill="url(#paint0_linear_108_12812)" />
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M5.95533 4.85604C6.61319 2.17412 9.32061 0.533298 12.0025 1.19115L96.5193 21.9225L103.273 32.0738L99.2828 48.3415C98.6249 51.0234 95.9175 52.6643 93.2356 52.0064L8.71886 31.275L1.96497 21.1238L5.95533 4.85604Z"
                fill="url(#paint1_linear_108_12812)" fill-opacity="0.5" />
              <path
                d="M10.2285 25.2144L8.74036 31.2812L1.96409 21.1279L8.76255 22.7955C9.83532 23.0587 10.4916 24.1417 10.2285 25.2144Z"
                fill="url(#paint2_linear_108_12812)" />
              <path
                d="M95.0116 27.989L96.5 21.92L103.276 32.0751L96.4776 30.4078C95.4048 30.1447 94.7485 29.0617 95.0116 27.989Z"
                fill="url(#paint3_linear_108_12812)" />
              <path
                d="M16.9974 22.803L19.2844 13.4794L23.2608 14.4548C23.3523 14.4772 23.4734 14.5115 23.6239 14.5576C23.7798 14.6004 23.9161 14.6476 24.0329 14.6991C24.5742 14.9234 24.9892 15.2197 25.2779 15.5879C25.5709 15.9573 25.7501 16.3765 25.8153 16.8455C25.8816 17.3102 25.8507 17.8037 25.7225 18.326C25.5944 18.8483 25.3908 19.3018 25.1115 19.6863C24.8377 20.0676 24.4855 20.3542 24.0548 20.546C23.6284 20.7388 23.1256 20.81 22.5463 20.7594C22.42 20.7467 22.2773 20.7255 22.1182 20.6956C21.9592 20.6657 21.836 20.6401 21.7488 20.6187L19.5513 20.0797L18.7763 23.2394L16.9974 22.803ZM19.9547 18.4351L22.0737 18.9549C22.1653 18.9773 22.2666 18.9976 22.3778 19.0157C22.4889 19.0338 22.5934 19.0412 22.6913 19.0377C22.947 19.0318 23.1588 18.9693 23.3266 18.8504C23.4955 18.727 23.6268 18.5785 23.7202 18.4046C23.8191 18.2275 23.8892 18.0548 23.9305 17.8865C23.9718 17.7181 23.9891 17.5347 23.9823 17.3363C23.9809 17.1346 23.9334 16.9422 23.8396 16.759C23.7469 16.5715 23.5886 16.416 23.3647 16.2924C23.2795 16.2441 23.1834 16.2022 23.0766 16.1669C22.9697 16.1315 22.8705 16.1026 22.7789 16.0801L20.6599 15.5603L19.9547 18.4351Z"
                fill="white" />
              <path
                d="M25.7662 24.9539L28.0533 15.6303L34.201 17.1383L33.7976 18.7829L29.4288 17.7113L28.9396 19.7055L32.5236 20.5846L32.1202 22.2292L28.5362 21.3501L27.9486 23.7457L32.3174 24.8174L31.914 26.4619L25.7662 24.9539Z"
                fill="white" />
              <path
                d="M33.7432 26.9106L36.0302 17.587L40.0066 18.5624C40.0981 18.5849 40.2192 18.6191 40.3696 18.6652C40.5255 18.708 40.6619 18.7552 40.7787 18.8067C41.32 19.031 41.7349 19.3273 42.0236 19.6956C42.3167 20.0649 42.4959 20.4841 42.5611 20.9531C42.6274 21.4179 42.5964 21.9114 42.4683 22.4337C42.2767 23.2149 41.9164 23.8359 41.3874 24.2964C40.8594 24.7527 40.161 24.9429 39.2921 24.8671L38.4946 24.7263L36.2971 24.1873L35.5221 27.347L33.7432 26.9106ZM39.0537 28.2133L38.127 23.9635L40.044 24.063L41.0681 28.7074L39.0537 28.2133ZM36.7005 22.5427L38.8195 23.0625C38.9111 23.085 39.0124 23.1053 39.1235 23.1234C39.2347 23.1415 39.3392 23.1488 39.4371 23.1454C39.6928 23.1394 39.9046 23.077 40.0724 22.958C40.2413 22.8347 40.3725 22.6861 40.466 22.5123C40.5649 22.3352 40.635 22.1624 40.6763 21.9941C40.7176 21.8258 40.7349 21.6424 40.7281 21.4439C40.7267 21.2422 40.6791 21.0498 40.5854 20.8666C40.4927 20.6792 40.3344 20.5236 40.1105 20.4001C40.0253 20.3517 39.9292 20.3099 39.8224 20.2745C39.7155 20.2391 39.6162 20.2102 39.5247 20.1877L37.4057 19.668L36.7005 22.5427Z"
                fill="white" />
              <path
                d="M46.2777 30.1912C45.5801 30.0201 44.9797 29.7447 44.4765 29.365C43.9788 28.982 43.6046 28.5196 43.3539 27.9776C43.1086 27.4323 43.0152 26.8328 43.0739 26.1791L44.998 26.3628C44.9975 26.9301 45.1667 27.4086 45.5056 27.7984C45.8445 28.1881 46.2756 28.4471 46.7988 28.5755C47.0909 28.6471 47.3855 28.6713 47.6824 28.6481C47.9793 28.6248 48.2367 28.5461 48.4545 28.4119C48.6767 28.2787 48.8195 28.0827 48.883 27.8237C48.9063 27.7287 48.9133 27.6343 48.904 27.5405C48.9 27.4435 48.8749 27.3481 48.8286 27.2543C48.7822 27.1606 48.7065 27.0642 48.6013 26.9652C48.5006 26.8673 48.3655 26.7678 48.1961 26.6667L45.9248 25.3545C45.7544 25.2578 45.5588 25.132 45.3379 24.9772C45.1214 24.8234 44.9215 24.6302 44.7382 24.3976C44.5548 24.165 44.4224 23.8854 44.3407 23.5588C44.2644 23.2289 44.2808 22.8417 44.3899 22.3971C44.5434 21.7712 44.8302 21.2901 45.2501 20.9538C45.67 20.6174 46.1708 20.4131 46.7525 20.3407C47.3342 20.2683 47.9472 20.3134 48.5914 20.476C49.239 20.644 49.7918 20.8963 50.2501 21.233C50.7083 21.5696 51.0599 21.983 51.3048 22.4733C51.5508 22.9592 51.6786 23.5122 51.6883 24.1324L49.6861 23.9845C49.6905 23.6652 49.6243 23.379 49.4876 23.1258C49.351 22.8726 49.1651 22.66 48.93 22.4879C48.6992 22.3169 48.4431 22.1923 48.1619 22.1142C47.8849 22.0371 47.6116 22.0112 47.3419 22.0366C47.0776 22.0587 46.8474 22.1304 46.6513 22.2516C46.4595 22.3739 46.3366 22.5451 46.2826 22.7652C46.2329 22.9681 46.2553 23.1498 46.35 23.3103C46.4457 23.4665 46.58 23.607 46.7528 23.7317C46.9256 23.8565 47.1059 23.9694 47.2937 24.0703L48.8208 24.9117C49.0491 25.0363 49.2982 25.189 49.5682 25.3696C49.8393 25.5459 50.0867 25.7622 50.3104 26.0184C50.5396 26.2714 50.7038 26.5725 50.803 26.9218C50.9066 27.2721 50.9007 27.6825 50.7853 28.153C50.6625 28.6537 50.4482 29.0657 50.1424 29.3888C49.8421 29.7087 49.483 29.9478 49.0651 30.1061C48.6483 30.2601 48.1983 30.342 47.7152 30.3516C47.2365 30.3623 46.7573 30.3088 46.2777 30.1912Z"
                fill="white" />
              <path
                d="M55.7988 32.5266C54.857 32.2956 54.0936 31.8933 53.5086 31.3196C52.928 30.747 52.5418 30.0506 52.3501 29.2302C52.1628 28.4108 52.1878 27.5177 52.4249 26.5508C52.6621 25.5839 53.0533 24.7807 53.5985 24.141C54.148 23.5025 54.8126 23.0637 55.5923 22.8248C56.3764 22.587 57.2393 22.5836 58.1811 22.8146C59.1229 23.0456 59.8841 23.4474 60.4647 24.02C61.0497 24.5936 61.4359 25.2901 61.6232 26.1094C61.8149 26.9298 61.7921 27.8235 61.5549 28.7904C61.3178 29.7573 60.9244 30.56 60.3749 31.1986C59.8297 31.8382 59.1651 32.277 58.381 32.5148C57.6013 32.7537 56.7406 32.7577 55.7988 32.5266ZM56.2054 30.8691C56.8006 31.0243 57.3289 31.0189 57.7902 30.8529C58.2516 30.6869 58.6396 30.3862 58.9544 29.9509C59.2736 29.5167 59.5126 28.9758 59.6714 28.3283C59.8302 27.6809 59.8676 27.0951 59.7835 26.5711C59.7037 26.0482 59.4978 25.6064 59.1656 25.2458C58.8334 24.8851 58.3697 24.6272 57.7745 24.4721C57.1793 24.3169 56.651 24.3224 56.1897 24.4883C55.7283 24.6543 55.3381 24.9544 55.0189 25.3887C54.7041 25.824 54.4673 26.3654 54.3085 27.0129C54.1497 27.6603 54.1101 28.2455 54.1899 28.7685C54.274 29.2925 54.4821 29.7348 54.8143 30.0954C55.1465 30.4561 55.6102 30.714 56.2054 30.8691Z"
                fill="white" />
              <path
                d="M61.9786 33.8366L64.2656 24.513L66.0707 24.9558L68.6401 32.1758L70.1648 25.96L71.9699 26.4028L69.6829 35.7264L67.8778 35.2836L65.3084 28.0636L63.7837 34.2794L61.9786 33.8366Z"
                fill="white" />
              <path
                d="M71.1154 36.0778L76.28 27.46L78.9353 28.1114L79.526 38.1408L77.6947 37.6916L77.148 28.8399L77.4881 28.9233L72.9466 36.527L71.1154 36.0778ZM73.3184 34.5589L73.7218 32.9143L78.6923 34.1335L78.2889 35.7781L73.3184 34.5589Z"
                fill="white" />
              <path
                d="M81.0906 38.5246L83.3776 29.201L85.1565 29.6374L83.2729 37.3164L87.3278 38.311L86.9244 39.9556L81.0906 38.5246Z"
                fill="white" />
              <defs>
                <linearGradient id="paint0_linear_108_12812" x1="3.50295" y1="14.8538" x2="101.595" y2="38.9151"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="#E93B57" />
                  <stop offset="1" stop-color="#EC5B54" />
                </linearGradient>
                <linearGradient id="paint1_linear_108_12812" x1="101.573" y1="39.003" x2="3.4814" y2="14.9417"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="white" stop-opacity="0" />
                  <stop offset="0.484375" stop-color="white" />
                  <stop offset="1" stop-color="white" stop-opacity="0" />
                </linearGradient>
                <linearGradient id="paint2_linear_108_12812" x1="9.74192" y1="27.1981" x2="1.00105" y2="25.054"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="#F8B1AF" />
                  <stop offset="1" stop-color="#F46D79" />
                </linearGradient>
                <linearGradient id="paint3_linear_108_12812" x1="95.4983" y1="26.0043" x2="104.239" y2="28.148"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="#F8B1AF" />
                  <stop offset="1" stop-color="#F46D79" />
                </linearGradient>
              </defs>
            </svg>

            <svg class="after-4-step" width="106" height="54" viewBox="0 0 106 54" fill="none"
              xmlns="http://www.w3.org/2000/svg">
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M5.95551 4.85609C6.61327 2.17414 9.32063 0.533216 12.0026 1.19097L96.5201 21.9192L103.274 32.0702L99.2846 48.3381C98.6268 51.02 95.9195 52.6609 93.2375 52.0032L8.72003 31.275L1.96576 21.124L5.95551 4.85609Z"
                fill="#6bd876" />
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M5.95551 4.85609C6.61327 2.17414 9.32063 0.533216 12.0026 1.19097L96.5201 21.9192L103.274 32.0702L99.2846 48.3381C98.6268 51.02 95.9195 52.6609 93.2375 52.0032L8.72003 31.275L1.96576 21.124L5.95551 4.85609Z"
                fill="url(#paint0_linear_108_12931)" />
              <path fill-rule="evenodd" clip-rule="evenodd"
                d="M5.95551 4.85609C6.61327 2.17414 9.32063 0.533216 12.0026 1.19097L96.5201 21.9192L103.274 32.0702L99.2846 48.3381C98.6268 51.02 95.9195 52.6609 93.2375 52.0032L8.72003 31.275L1.96576 21.124L5.95551 4.85609Z"
                fill="url(#paint1_linear_108_12931)" fill-opacity="0.5" />
              <path
                d="M10.2291 25.2144L8.74121 31.2812L1.96457 21.1282L8.76309 22.7955C9.83587 23.0586 10.4922 24.1416 10.2291 25.2144Z"
                fill="url(#paint2_linear_108_12931)" />
              <path
                d="M95.0128 27.9869L96.501 21.918L103.278 32.0728L96.4789 30.4057C95.4061 30.1426 94.7497 29.0597 95.0128 27.9869Z"
                fill="url(#paint3_linear_108_12931)" />
              <path
                d="M20.8721 24.5883C19.8931 24.3482 19.1 23.9279 18.4929 23.3273C17.8904 22.7279 17.4904 21.9979 17.293 21.1375C17.1001 20.2781 17.1282 19.3408 17.3772 18.3256C17.6262 17.3103 18.035 16.4664 18.6036 15.7938C19.1767 15.1223 19.869 14.6603 20.6805 14.4076C21.4966 14.1561 22.3941 14.1504 23.3731 14.3905C24.4971 14.6662 25.3715 15.1761 25.9962 15.9204C26.6254 16.6657 26.9797 17.5526 27.059 18.5811L25.0695 18.6409C25.0338 18.0027 24.8407 17.4677 24.4902 17.0357C24.1407 16.5993 23.6261 16.2977 22.9463 16.1309C22.3253 15.9786 21.7725 15.9896 21.2877 16.1638C20.8074 16.3391 20.4014 16.6528 20.0695 17.1047C19.7376 17.5567 19.4883 18.1226 19.3216 18.8025C19.1548 19.4823 19.114 20.0993 19.1991 20.6536C19.2842 21.2078 19.4991 21.6737 19.8437 22.0513C20.1929 22.4301 20.678 22.6956 21.2989 22.8479C21.9787 23.0146 22.5745 22.9853 23.0863 22.7601C23.598 22.5348 24.0167 22.1498 24.3425 21.6051L26.0786 22.5786C25.5324 23.4537 24.808 24.0761 23.9053 24.4457C23.0072 24.8164 21.9961 24.864 20.8721 24.5883ZM30.7584 27.013C29.7794 26.7729 28.9864 26.3525 28.3793 25.752C27.7767 25.1525 27.3767 24.4226 27.1793 23.5621C26.9865 22.7028 27.0145 21.7655 27.2635 20.7502C27.5125 19.735 27.9213 18.8911 28.4899 18.2185C29.063 17.547 29.7553 17.0849 30.5668 16.8323C31.3829 16.5808 32.2804 16.5751 33.2594 16.8152C34.2384 17.0553 35.0292 17.475 35.6317 18.0745C36.2388 18.675 36.6388 19.405 36.8317 20.2643C37.0291 21.1248 37.0033 22.0626 36.7543 23.0779C36.5053 24.0931 36.0942 24.9365 35.5211 25.608C34.9525 26.2806 34.2602 26.7426 33.4442 26.9942C32.6326 27.2468 31.7374 27.2531 30.7584 27.013ZM31.1852 25.2725C31.8039 25.4339 32.3534 25.4269 32.8337 25.2516C33.3139 25.0763 33.7183 24.7598 34.0467 24.3022C34.3797 23.8457 34.6296 23.2775 34.7963 22.5977C34.963 21.9178 35.0033 21.3031 34.9171 20.7534C34.8354 20.2048 34.6222 19.7417 34.2776 19.3641C33.933 18.9864 33.4513 18.7169 32.8326 18.5556C32.2139 18.3942 31.6644 18.4012 31.1841 18.5765C30.7039 18.7519 30.2973 19.0678 29.9643 19.5243C29.6358 19.9819 29.3882 20.5506 29.2215 21.2304C29.0548 21.9103 29.0122 22.5245 29.0939 23.0731C29.1801 23.6228 29.3956 24.0864 29.7402 24.4641C30.0848 24.8417 30.5665 25.1112 31.1852 25.2725ZM36.6526 28.2423L39.0536 18.4524L40.7124 18.8593L42.3545 26.1523L47.1846 20.4466L48.8435 20.8534L46.4425 30.6433L44.7156 30.2198L46.1496 24.3731L41.8738 29.5228L41.2212 29.3628L39.8133 22.8191L38.3794 28.6658L36.6526 28.2423ZM48.0925 31.048L50.4935 21.2581L54.627 22.2719C54.7222 22.2952 54.848 22.3309 55.0044 22.3788C55.1664 22.4234 55.3081 22.4725 55.4295 22.5263C55.9919 22.7604 56.4228 23.0703 56.7222 23.456C57.0262 23.8429 57.2115 24.2823 57.2782 24.7744C57.346 25.2619 57.3127 25.7799 57.1782 26.3283C57.0437 26.8767 56.8308 27.353 56.5394 27.7573C56.2537 28.1581 55.8867 28.4597 55.4382 28.662C54.9943 28.8655 54.4712 28.9414 53.8688 28.8897C53.7375 28.8768 53.5891 28.8548 53.4237 28.8238C53.2583 28.7929 53.1303 28.7663 53.0396 28.7441L50.7553 28.1838L49.9417 31.5015L48.0925 31.048ZM51.1789 26.457L53.3816 26.9972C53.4768 27.0206 53.5821 27.0416 53.6976 27.0603C53.8132 27.079 53.9219 27.0865 54.0237 27.0826C54.2897 27.0758 54.5101 27.0097 54.685 26.8844C54.8609 26.7546 54.9978 26.5984 55.0954 26.4157C55.1987 26.2296 55.272 26.0482 55.3154 25.8714C55.3587 25.6947 55.3771 25.5022 55.3705 25.294C55.3696 25.0823 55.3206 24.8805 55.2235 24.6885C55.1276 24.492 54.9633 24.3292 54.7307 24.2001C54.6422 24.1495 54.5424 24.1058 54.4313 24.069C54.3202 24.0321 54.2171 24.002 54.1219 23.9787L51.9192 23.4385L51.1789 26.457ZM56.8135 33.1868L59.2145 23.397L61.0637 23.8505L59.0862 31.9135L63.3013 32.9473L62.8778 34.6741L56.8135 33.1868ZM63.7754 34.8943L66.1764 25.1044L72.567 26.6717L72.1435 28.3985L67.6021 27.2847L67.0885 29.3787L70.8141 30.2924L70.3906 32.0192L66.665 31.1055L66.0481 33.621L70.5895 34.7348L70.166 36.4616L63.7754 34.8943ZM73.8079 37.3548L75.7854 29.2917L72.6988 28.5347L73.1224 26.8079L81.1446 28.7754L80.7211 30.5022L77.6346 29.7452L75.6571 37.8083L73.8079 37.3548ZM79.5778 38.7699L81.9788 28.98L88.3694 30.5473L87.9459 32.2741L83.4045 31.1603L82.891 33.2543L86.6165 34.168L86.193 35.8948L82.4674 34.9811L81.8505 37.4966L86.3919 38.6104L85.9684 40.3372L79.5778 38.7699Z"
                fill="white" />
              <defs>
                <linearGradient id="paint0_linear_108_12931" x1="3.50351" y1="14.8539" x2="101.596" y2="38.9116"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="#5ED56A" />
                  <stop offset="1" stop-color="#5ED46A" />
                </linearGradient>
                <linearGradient id="paint1_linear_108_12931" x1="101.575" y1="38.9994" x2="3.48195" y2="14.9418"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="white" stop-opacity="0" />
                  <stop offset="0.484375" stop-color="white" />
                  <stop offset="1" stop-color="white" stop-opacity="0" />
                </linearGradient>
                <linearGradient id="paint2_linear_108_12931" x1="9.74263" y1="27.1981" x2="1.00167" y2="25.0543"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="#BDFEC4" />
                  <stop offset="1" stop-color="#56EC65" />
                </linearGradient>
                <linearGradient id="paint3_linear_108_12931" x1="95.4995" y1="26.0022" x2="104.24" y2="28.1456"
                  gradientUnits="userSpaceOnUse">
                  <stop stop-color="#BDFEC4" />
                  <stop offset="1" stop-color="#56EC65" />
                </linearGradient>
              </defs>
            </svg>
          </div>
          <div class="personal-offer__count-steps">
            <div class="persona-offer__step active-step-js">
              <p class="personal-offer__count-step">1</p>
              <p class="personal-offer__step-active">шаг</p>
            </div>
            <div class="persona-offer__step">
              <p class="personal-offer__count-step">2</p>
              <p class="personal-offer__step-active">шаг</p>
            </div>
            <div class="persona-offer__step">
              <p class="personal-offer__count-step">3</p>
              <p class="personal-offer__step-active">шаг</p>
            </div>
            <div class="persona-offer__step">
              <p class="personal-offer__count-step">4</p>
              <p class="personal-offer__step-active">шаг</p>
            </div>
          </div>
        </div>
        <PesonalOffer />
      </div>
    </div>
  </section>
</template>

<script>
import PesonalOffer from '../components/personal-offer.vue';

export default {
  components: {
    PesonalOffer,
  },

  data() {
    return {
      tabs: [
        { id: 'day-tours', title: 'Day Tours' },
        { id: 'weekend-tour', title: 'Weekend Tour' },
        { id: 'multi-day-tours', title: 'Multi-day Tours' }
      ],
      activeTab: 'day-tours',
      isActive: false,
    };
  },
  methods: {
    toggleTab(tabId) {
      this.activeTab = tabId;
      const blockElements = this.$refs.blockElements; // Получаем ссылку на блок tours-list__block-elements
      const elements = blockElements.getElementsByClassName('tab-container'); // Находим все элементы с классом tab-container

      // Проходимся по каждому элементу и проверяем его id
      Array.from(elements).forEach(element => {
        if (element.id === tabId) {
          console.log("Выбран существующий tabId:", tabId);
          element.classList.add("show-tab"); // Добавляем класс "show-tab" к выбранному элементу
        } else {
          element.classList.remove("show-tab"); // Удаляем класс "show-tab" у других элементов
        }
      });
    },
  },
};
</script>

<style scoped lang="scss">
/* .block-elements__for-love */
</style>
